CNS/src/Documents/УстановкаКоэффициентовНачислений/УстановкаКоэффициентовНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаКоэффициентовНачислений</name>
  <registerRecords>InformationRegister.КоэффициентыНачислений</registerRecords>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.ВидыНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.ПериодыХраненияЗначений</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

CNS/src/InformationRegisters/КоэффициентыНачислений/КоэффициентыНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоэффициентыНачислений</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.ВидыНачислений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.ПериодыХраненияЗначений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CNS/src/Documents/УстановкаКоэффициентовНачислений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	Бюджетирование.ЗаполнитьНаборыЗначенийДоступа(ЭтотОбъект, Таблица);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
КонецПроцедуры 

Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр КоэффициентыНачислений
	Движения.КоэффициентыНачислений.Записывать 	= Истина;
	Движение 							= Движения.КоэффициентыНачислений.Добавить();
	Движение.Сценарий 					= Сценарий;
	Движение.Период 					= Дата;
	Движение.ВидНачисления 				= ВидНачисления;
	Движение.ПериодДействия 			= ПериодДействия;
	Движение.Коэффициент 				= Коэффициент;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции.





#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
